# Dotfiles/bootstrap
brew "git"
brew "gh"
brew "just"
brew "stow"

# Shell/search/navigation
brew "starship"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "tree"

# Editor
brew "neovim"
brew "rust-analyzer"

# Git workflow
brew "lazygit"
brew "git-delta"

# Broad development managers
brew "go"
brew "nvm"
brew "rustup"

# Core apps
cask "ghostty"
cask "codex"
cask "google-chrome"
cask "obsidian"
cask "raycast"
cask "slack"
cask "spotify"
cask "discord"
cask "docker-desktop"
